export const config = {
  title: 'โรงเรียนวัดนาหนอง',
  fullTitle: 'โรงเรียนวัดนาหนอง (วิธานราษฎร์อนุกูล)',
  tagLine: 'ศูนย์การค้นหาบริการและข้อมูลของโรงเรียนออนไลน์',
  address: 'หมู่ 2 ตำบลดอนแร่ อำเภอเมือง จังหวัดราชบุรี 70000',
  organization: 'สำนักงานเขตพื้นที่การศึกษาประถมศึกษาราชบุรี เขต 1',
  url: 'https://watnanong.netlify.app',
  baseUrl: '/',
  fbId: 102432438057537,
  gpsLatLon: '13.492997 N, 99.764039 E',
  lastUpdate: 'พฤษภาคม 2566',
  navbar: [
    {
      to: '/',
      label: 'หน้าแรก',
    },
    {
      to: '/about',
      label: 'เกี่ยวกับเรา',
    },
    {
      to: '/people',
      label: 'บุคลากร',
    },
    {
      to: '/contact',
      label: 'ติดต่อเรา',
    },
  ],

  bannerHomepage: '/src/images/bg-school.jpg',
  bannerHomepageAlt: 'In front of the school',
  bannerHompageHeading: 'โรงเรียนวัดนาหนองเป็นส่วนหนึ่งของชุมชนบวร',
  bannerHompageDesc: 'บ้าน | วัดนาหนอง | โรงเรียนวัดนาหนอง',
  footerBg: '/src/images/pupils-play-soccer.jpg',
  footerBgAlt: 'Students play soccer',
  about: [
    {
      p: 'โรงเรียนวัดนาหนอง (วิธานราษฎร์อนุกูล) ก่อตั้งเมื่อปี พ.ศ. 2465 ในตำบลดอนแร่ อำเภอเมืองราชบุรี จังหวัดราชบุรี เปิดทำการสอนตั้งแต่ระดับชั้นอนุบาลปีที่ 2 ถึง ชั้นประถมศึกษาปีที่ 6 มีอาคารเรียน 2 หลัง อาคารประกอบ 1 หลัง และอาคารเอนกประสงค์ 1 หลัง บ้านพักครู 1 หลัง ตั้งอยู่ในพื้นที่วัดนาหนอง จังหวัดราชบุรี',
    },
    {
      p: 'โรงเรียนวัดนาหนองก่อตั้งครั้งแรกโดยอาศัยศาลาวัดเป็นที่เรียน ต่อมาในปี พ.ศ. 2482 เจ้าอาวาสวัด ท่านพระครูวิธานศาสนกิจ (หลวงพ่อโห้) เจ้าอาวาสวัดได้ชักชวนประชาชนร่วมกันบริจาคเงินสร้างอาคารเรียนขึ้นมา 1 หลัง และใช้ชื่ออาคารเรียนหลังนี้ว่า "โรงเรียนวัดนาหนอง (วิธานราษฎร์อนุกูล)" ปัจจุบันชำรุดทรุดโทรมหมดสภาพไปแล้ว',
    },
    {
      p: 'ในปีพ.ศ. 2518 เจ้าอาวาสวัดในขณะนั้น ท่านพระครูเอนก รตฺนวณฺโณได้ร่วมกับประชาชนบริจาคเงินสมทบกับทางราชการก่อสร้างอาคารเรียนขึ้นมาใหม่ 1 หลัง โดยใช้นามอาคารเรียนว่า เอนกรัฐ และได้ใช้เป็นที่เรียนจนกระทั่งทุกวันนี้ ต่อมาทางราชการได้ขยายการศึกษาภาคบังคับถึงชั้นประถมศึกษาปีที่ 6 มีจำนวนนักเรียนมากขึ้น จึงได้จัดสรรงบประมาณสร้างอาคารเรียนอีก 1 หลังในปี พ.ศ. 2524 รวมเป็นทั้งหมด 2 หลัง',
    },
  ],
  people: [
    { img: '', title: 'นายธิตติยพัทย์ อยู่จิตร์', rank: 'ผู้อำนวยการโรงเรียน', desc: '' },
    { img: '', title: 'นางสาวนฤมล เปี่ยมพร้อม', rank: 'ครู', desc: '' },
    { img: '', title: 'นายสิริวัตร สมใจ', rank: 'ครู', desc: '' },
    { img: '', title: 'นางสาวสิรีธร ยางเดิม', rank: 'ครู', desc: '' },
    { img: '', title: 'นางสาวหงษ์นภา คงหนู', rank: 'ครู', desc: '' },
    { img: '', title: 'นางสาวโชตินา ขจิตสุวรรณ', rank: 'ครู', desc: '' },
    { img: '', title: 'นางสาวพรรณภัทร ไผ่ทอง', rank: 'เจ้าหน้าที่ธุรการ', desc: '' },
    { img: '', title: 'นายสุภาพ ใจมุ่ง', rank: 'นักการภารโรง', desc: '' },
  ],
};
